import sys
sys.stdin = open('input.txt')
'''
D장을 쌓아서 만든다. 즉. 높이h 인가?
한 장은 동일한 크기의 bar를 W개 붙여서 만들어진다.

즉, 두꼐가 D 높이가 W 이다.
각 바들은 A / B의 특성을 가지고 있다.

합격 기준 K가 존재한다.
세로방향으로 동일한 특성의 셀들이 K개 이상 연속적으로 있는 경우에만 성능검사를 통과한다.

특정 약품을 통해서 한 줄 전체를 하나의 특성을 가지게 만들 수 있다.  A -> B   /   B -> A

D, W, K 가 주어질 때 최소 몇번의 약품 투입을 통해 성능 검사를 통과하는지 알아내라.
약품 사용안하면 그냥 0을 출력한다.
=================================================================================

가로 세로 전환이 가능하다면 편할거같긴한데.. 잘 모르겠다.
순열과 조합 문제인가? 최대한 연산의 횟수를 줄여나가야한다.
가지치기를 해야한다. -> 만약 K 조건을 만족시키지 못한다면 뒤도 안돌아보고 다음 반복으로 가기

순열 조합이 맞다고 생각한다.
약품의 최대 사용횟수는 D이다. D는 최대 13... 순열과 조합으로 약품을 넣는 경우의 수를 확인해본다면..
최악의 경우 32만번정도의 계산이 필요하다.. 이정도면 가지치기같은 로직으로 충분히 가능하다고 생각한다.

아니 일단 한번씩 늘려가면서 약품을 투약한다면 한번이라도 성공 조건을 만족한다면 그 자리에서 그냥 프로그램 종료하고
약품 투여횟수 반환하면 끝 아닌가?
-> 어차피 이후에는 투약 횟수를 점점 늘려갈거니깐 최소 투약횟수를 구하는데는 필요없는 연산이다.

가지치기 로직 정리
1. 좌우로 K만큼 연속적인지 검사하는데 한번이라도 만족하지 못한다면 다음 경우의 수로 넘어간다.
2. 단 한번이라도 성공조건을 만족한다면 그 자리에서 바로 프로그램을 종료한다.

순환 로직 정리

일단 약품을 투약할 모든 경우의 수를 구해놓는다.
처음 탐색할 때는 세로기준으로 K만큼 동일한 수가 연속되는지 검사한다. 한번이라도 틀리다면 다음 경우의 수로 넘어간다.

만약 1차적으로 완탐을 돌렸다면 약품투약 경우의 수를 모두 돌려본다.
'''
import itertools

# ls = [1, 2, 3, 4, 5, 6, 7, 8,9,10,11,12,13]
# all_pssible = []
# for i in range(1, len(ls) + 1):
#     all_pssible.extend(list(itertools.combinations(ls, i)))
#
# print(all_pssible)
# print(len(all_pssible))

T = int(input())
T = 1
for tc in range(1, T + 1):

    # 두께, 가로, 합격 기준
    D, W, K = map(int, input().split())
    board = [list(map(int, input().split())) for _ in range(D)]

    for r in board:
        print(r)
    pass