import sys
sys.stdin = open('input.txt')

'''
백준이 퇴사 땡김
오늘부터 N + 1일째날 퇴사를 목표로 남은 N일동안 **최대한**많은 
상담을 하려고 한다.
비서는 하루에 하나씩 서로 다른 사람의 상담을 잡아놓는다.

각 상담의 완료 기간 T, 받는 금액 P로 이루어짐
 	1일	2일	3일	4일	5일	6일	7일
Pi	10	20	10	20	15	40	200
Ti	3	5	1	1	2	4	2

-INPUT
    N: 총 상담 일자 (1 <= N <= 15)
    Ti, Pi (1<=T1<=5), (1<=P1<=1000)
-OUTPUT
    Maximum Price
    
결론은 상담시간이 짧고 가격이 비싼순으로 정렬하는건가?
그게 가능한가?
아마 상담순서를 맘대로 바꾸지는 못하는거같다.
정렬은 불가능할듯?
'''

N = int(input()) # 총 상담받는 일자
plan = []

for _ in range(N):
    T, P = map(int, input().split())
    plan.append((T, P))

for idx in range(len(plan)-1, -1, -1):
    print(plan[idx])

# 정렬하기 전에 일단 뒤에 불가능한 날자부터 삭제해서
# 경우의 수를 좀 줄여보자.



'''
Ti = [1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
Pi = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
55
'''