import sys
sys.stdin = open('input.txt')
"""
로봇 청소기와 방의 상태가 주어질 때, 로봇이 청소하는 **영역**의 갯수를 반환해라

방의 크기는 N * M으로 주어진다. 각각의 칸은 벽 또는 빈칸이다.
청소기는 동 서 남 북 하나로 바라본다.
각 방의 좌표는 (r,c)로 나타내고, 가장 북쪽 줄 가장 서쪽 칸의 좌표가 (0, 0)
가장 오른쪽아래가 (N-1, M-1)이다.

즉, 좌표(r,c)는 (r+1, c+1)을 가리킨다..?

로봇청소기 작동 로직
1. 현재칸이 청소된게 아니면 청소한다.
2. 현재 칸의 주변 4칸 중 청소 되지 않은 빈 칸이 없는 경우
    바라보는 방향을 유지하내로 한칸 후진 가능하다면 한칸 후진하고 1번으로 돌아간다.
    후진이 불가능하면 작동을 멈춘다.
3. 현재 칸의 주변 4칸 중 청소되지 않은 빈칸이 있는 경우
    1. 반시계방향으로 회전
    2. 바라보는 방향을 기준으로 앞쪽 칸이 청소 ㄴㄴ 면 전진하면서 청소
    3. 1번으로 돌아간다.
"""
# 여기 아래에 코드 ㄱㄱ

def DFS(si, sj, robot):
    # 일반적으로는 상 하 좌 우로 델타탐색을 했지만
    # 여기서는 주어진 조건에 의해서 북(상) 동(우) 남(하) 서(좌) 로 해야한다.
    di = [-1, 0, 1, 0]
    dj = [0, 1, 0, -1]

    for k in range(3, -1, -1): # 문제 조건때문에 역순으로 순회하기
        ni, nj = si + di[k], sj + dj[k]
        # 주변에 빈칸(0)이 있는 경우
        if 0 <= ni < M and 0 <= nj < N and mat[ni][nj] == 0:
            # 반시계 방향으로 회전
            robot[2] = ((robot[2] + 3) % 4)
            # 바라보는 기준 앞쪽이 빈 칸인 경우 전진
            DFS(ni, nj, robot)
            # 청소하고 반복
            pass
        # 주변에 빈칸(0)이 없는 경우
        elif 0 <= ni < M and 0 <= nj < N and mat[ni][nj] != 0:
            pass

# 가로, 세로
N, M = map(int, input().split()) # 11, 10
# (r, c), 방향
# 0: 북, 1: 동, 2: 남, 3: 서
robot = list(map(int, input().split())) # [7, 4, 0]

# 1이면 벽, 0이면 청소해야하는곳, 2면 청소한 곳
mat = [list(map(int, input().split())) for _ in range(M)]

# 먼저 가장 처음장소는 청소하기
si, sj = robot[0], robot[1]
mat[si][sj] = 2

# 그 다음 DFS로 호출하고 함수안에 로봇 청소기 작동 로직을 구현한다.
DFS(si, sj, robot)

# 2차원 배열 이름 입력하셈
for row in mat:
    print(row)