import sys
sys.stdin = open('input.txt')
"""
크기가 M * M인 지도가 존재한다.
오른쪽 동쪽, 위쪽 북쪽이다.

주사위 기준 윗면이 1이고, 동쪽은 3 놓여져 있는 곳의 좌표는 (x, y)이다. 가장 처음 추사위에는 모든 면에 0이 적혀있다.

지도의 각 칸에는 정수가 하나씩 쓰여있다. 주사위를 굴렸을 때, 이동한 칸에 쓰여 있는 수가 0이면, 주사위의 바닥면에 쓰여 있는 수의 칸에 복사된다.
(아마도 그러면 1의 반대방향 6이 적힌다는 예시인듯)

0이 아닌 경우에는 지도에 있는 정수가 주사위의 바닥 면에 복사되고 지도의 숫자는 0으로 변한다.

주사위는 지도안에만 존재한다.
만약 밖으로 이동하려고 하면 해당 명령은 무시하며, 출력도 하면 안된다. *****

그냥 간단한 시뮬레이션같다. 구현도 필요없을거같은데
주사위의 정보는 2차원 리스트로 구현한 다음에 6개의 리스트만 채워넣으면 끝날 듯

[0, 2, 0]
[4, 1, 3]
[0, 5, 0]
[0, 6, 0]
이런 느낌으로... 다뤄야 할 듯 그리고 바닥면 고를 때에는 % 써가지고 가로면 +2 세로면 +2 해야 할듯

출력으로는 윗면의 값만 출력하고 주사위가 맵 밖으로 나갈려고 하면 그냥 continue 해야한다.
"""
# 상 하 좌 우
# 3 4 2 1
# 움직이는 명령어가 1부터 시작함으로 맨 처음에 0을 더해준다.
di = [0, -1, 1, 0, 0]
dj = [0, 0, 0, -1, 1]

def print_top(i, j):
    # 현재 가리키고 있는 부분(i, j)에 따라서 실행해야 하는 로직이 나뉜다.
    # 가로기준으로 반대편을 할지, 세로 기준으로 반대편을 출력할지 정해야 한다.

    # 만약 i가 1이고, j가 0 <= j <= 2 이면 가로방향의 로직을 출력한다.
    if i == 1 and 0 <= j <= 2:
        print(dice[i][(j + 2) % 3]) # 3 아니면 2 일듯
    # 만약 i가 0 <= i <= 3 이고 j가 1이면 세로방향의 로직을 출력한다.
    if 0 <= i <= 3 and j == 1:
        print(dice[(i + 2) % 3][j])

# 세로, 가로, 주사위 좌표(x, y), 명령의 개수
N, M, X, Y, K = map(int, input().split())
board = [list(map(int, input().split())) for _ in range(N)]
orders = list(map(int, input().split()))

# 0, 윗, 북, 동, 서, 남, 바닥
dice = [0 for _ in range(7)] # [0, 0, 0, 0, 0, 0]

# 지도 기준의 좌표
bi, bj = Y, X

dice_i, dice_j = 1, 1

for o in orders:
    bi += di[o]
    bj += dj[o]

    # 만약 다음 명령어가 지도 안에 없다면 continue 한다
    if 0 <= bi < N and 0 <= bj < M:
    # 만약 다음 명령어 방향이 지도 안에 있다면 그쪽으로 주사위를 굴린다.


        # 굴린 방향의 지도값이 0이라면
        if board[bi][bj] == 0:
            # 주사위 바닥에 있는 값이 지도에 복사된다.
            board[bi][bj] = dice[dice_i][dice_j]
            print_top(dice_i, dice_j)
        # 0이 아닌 경우에는 칸에 쓰여있는 수가 주사위 바닥면으로 복사되며, 칸에 쓰여 있는 수는 0이 된다.
        else:
            dice[dice_i][dice_j] = board[bi][bj]
            board[bi][bj] = 0
            print_top(dice_i, dice_j)
    else:
        print('주사위가 맵 밖으로 나감')
        continue










